nRFMesh/nRF52_Mesh/drivers/mesh.c
/** @file mesh.c
 *
 * @author Wassim FILALI
 *
 * @compiler arm gcc
 *
 *
 * $Date: 31.05.2018 adding doxy header and mesh commander functions
 *
*/

#include "mesh.h"

#include "sdk_common.h"

#include "boards.h"

#include "nrf_esb.h"
#include "nrf_esb_error_codes.h"

#include "nrf_delay.h"
#include <stdio.h>
//for sprint_buf
#include "utils.h"

#if defined( __GNUC__ ) && (__LINT__ == 0)
    // This is required if one wants to use floating-point values in 'printf'
    // (by default this feature is not linked together with newlib-nano).
    // Please note, however, that this adds about 13 kB code footprint...
    __ASM(".global _printf_float");
#endif

#define NRF_LOG_MODULE_NAME mesh

#if (MESH_CONFIG_LOG_ENABLED == 1)
#define NRF_LOG_LEVEL MESH_CONFIG_LOG_LEVEL
#else //MESH_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL 0
#endif //MESH_CONFIG_LOG_ENABLED

#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();


#define Mesh_Pid_Alive 0x05
#define Mesh_Pid_Reset 0x04
#define Mesh_Pid_Button 0x06

//light was 16bit redefined u32 bit
#define Mesh_Pid_Light 0x07
#define Mesh_Pid_Temperature 0x08
//bme280 no more with uncalibrated params
#define Mesh_Pid_bme        0x0A
//following rgb is led color control
#define Mesh_Pid_led_rgb    0x0B
#define Mesh_Pid_light_rgb  0x0E
#define Mesh_Pid_Humidity   0x11
#define Mesh_Pid_Pressure   0x12
#define Mesh_Pid_accell     0x13
#define Mesh_Pid_new_light  0x14
#define Mesh_Pid_Battery    0x15

#define MESH_IS_BROADCAST(val) ((val & 0x80) == 0x80)
#define MESH_IS_PEER2PEER(val) ((val & 0x80) == 0x00)
//Ack if bits 1,2 == 1,0 => MASK 0x60, VAL 0x40
#define MESH_IS_ACKNOWLEDGE(val) ((val & 0x60) == 0x40)
#define MESH_WANT_ACKNOWLEDGE(val) ((val & 0xF0) == 0x70)

#define MESH_Broadcast_Header_Length 4
#define MESH_P2P_Header_Length 5

#define MESH_cmd_node_id_set        0x01
#define MESH_cmd_node_id_get        0x02
#define MESH_cmd_rf_chan_set        0x03
#define MESH_cmd_rf_chan_get        0x04
#define MESH_cmd_tx_power_set       0x05
#define MESH_cmd_tx_power_get       0x06
#define MESH_cmd_bitrate_set        0x07
#define MESH_cmd_bitrate_get        0x08
#define MESH_cmd_crc_set            0x09
#define MESH_cmd_crc_get            0x0A


const char * const pid_name[] = {  "",          //0x00
                                "ping",         //0x01
                                "request_pid",  //0x02
                                "0x03",         //0x03
                                "reset",        //0x04
                                "alive",        //0x05
                                "button",       //0x06
                                "light",        //0x07
                                "temperature",  //0x08
                                "heat",         //0x09
                                "bme",          //0x0A
                                "rgb",          //0x0B
                                "magnet",       //0x0C
                                "dimmer",       //0x0D
                                "light_rgb",    //0x0E
                                "gesture",      //0x0F
                                "proximity",    //0x10
                                "humidity",     //0x11
                                "pressure",     //0x12
                                "acceleration", //0x13
                                "light_n",      //0x14
                                "Battery",      //0x15
                                "" };    

#include "uicr_user_defines.h"

static nrf_esb_config_t nrf_esb_config         = NRF_ESB_DEFAULT_CONFIG;
static nrf_esb_payload_t tx_payload = NRF_ESB_CREATE_PAYLOAD(0, 0x01, 0x00);
static nrf_esb_payload_t rx_payload;
static message_t rx_msg;
static volatile bool esb_completed = false;
static volatile bool esb_tx_complete = false;

static app_mesh_rf_handler_t m_app_rf_handler;

static app_mesh_cmd_handler_t m_app_cmd_handler;

void mesh_tx_message(message_t* msg);



//-------------------------------------------------------------
//------------------------- Mesh Core -------------------------
//-------------------------------------------------------------




uint16_t mesh_node_id()
{
    return UICR_NODE_ID;
}

uint8_t mesh_channel()
{
    return UICR_RF_CHANNEL;
}

uint8_t mesh_get_channel()
{
    return NRF_RADIO->FREQUENCY;
}

bool mesh_set_crc(uint8_t crc)
{
    switch(crc)
    {
        case NRF_ESB_CRC_16BIT:
            NRF_RADIO->CRCINIT = 0xFFFFUL;      // Initial value
            NRF_RADIO->CRCPOLY = 0x11021UL;     // CRC poly: x^16+x^12^x^5+1
            break;
        
        case NRF_ESB_CRC_8BIT:
            NRF_RADIO->CRCINIT = 0xFFUL;        // Initial value
            NRF_RADIO->CRCPOLY = 0x107UL;       // CRC poly: x^8+x^2^x^1+1
            break;
        
        case NRF_ESB_CRC_OFF:
            break;
        
        default:
            return false;
    }
    NRF_RADIO->CRCCNF = crc;
    return true;
}

uint8_t mesh_get_crc()
{
    return (uint8_t)NRF_RADIO->CRCCNF;
}



void mesh_pre_tx()
{
    if(UICR_is_listening())
    {
        nrf_esb_stop_rx();
        NRF_LOG_DEBUG("switch to IDLE mode that aloows TX");
    }

}

void mesh_post_tx()
{
    if(UICR_is_listening())
    {
        nrf_esb_start_rx();
        NRF_LOG_DEBUG("switch to RX mode");
    }
}

void mesh_message_2_esb_payload(message_t *msg,nrf_esb_payload_t *p_tx_payload)
{
    //esb only parameters
    p_tx_payload->noack    = true;//Never request an ESB acknowledge
    p_tx_payload->pipe     = 0;//pipe is the selection of the address to use

    p_tx_payload->data[1] = msg->control;
    p_tx_payload->data[2] = msg->pid;
    p_tx_payload->data[3] = msg->source;

    uint8_t start_payload;
    if(MESH_IS_BROADCAST(msg->control))
    {
        start_payload = MESH_Broadcast_Header_Length;
    }
    else
    {
        p_tx_payload->data[4] = msg->dest;
        start_payload = MESH_P2P_Header_Length;
    }

    //this is the total ESB packet length
    p_tx_payload->length   = msg->payload_length + start_payload;
    p_tx_payload->data[0] = p_tx_payload->length;
    memcpy( p_tx_payload->data+start_payload,
            msg->payload,
            msg->payload_length);
}

