nRFMesh/nRF52_Mesh/drivers/mesh.c
void mesh_esb_2_message_payload(nrf_esb_payload_t *p_rx_payload,message_t *msg)
{
    msg->control = p_rx_payload->data[1];
    msg->pid = p_rx_payload->data[2];
    msg->source = p_rx_payload->data[3];

    msg->rssi = p_rx_payload->rssi;
    //dest is processed by esb rx function
    uint8_t payload_start;
    if(MESH_IS_BROADCAST(msg->control))
    {
        msg->dest = 255;
        payload_start = 4;
    }
    else
    {
        msg->dest = p_rx_payload->data[4];
        payload_start = 5;
    }
    msg->payload_length = p_rx_payload->length - payload_start;

    if(msg->payload_length > 0)
    {
        msg->payload = p_rx_payload->data + payload_start;
    }
}

void mesh_rx_handler(message_t* msg)
{
    uint8_t ctrl_backup = msg->control;

    if(MESH_WANT_ACKNOWLEDGE(msg->control))
    {
        if(msg->dest == UICR_NODE_ID)//current node id match
        {
            message_t ack;

            ack.control = 0x40 | 2;         // ack | ttl = 2
            ack.pid     = msg->pid;
            ack.source  = msg->dest;        // == UICR_NODE_ID
            ack.dest    = msg->source;
            ack.payload_length = 0;

            mesh_tx_message(&ack);
        }
    }
    //only re-route messaegs directed to other than the current node itself
    else if(UICR_is_router())
    {
        uint8_t ttl = msg->control & 0x0F;
        if(ttl>0)
        {
            ttl--;
            msg->control &= 0xF0;//clear ttl
            msg->control |= ttl;
            mesh_tx_message(msg);
        }
    }
    
    //The app gets everything
    if(m_app_rf_handler != NULL)
    {
        
        msg->control = ctrl_backup;
        m_app_rf_handler(msg);
    }
}

void mesh_consume_rx_messages()
{
    static uint32_t count = 0;
    // Get the most recent element from the RX FIFO.
    while(nrf_esb_read_rx_payload(&rx_payload) == NRF_SUCCESS)
    {
        mesh_esb_2_message_payload(&rx_payload,&rx_msg);
        NRF_LOG_INFO("ESB Rx %d- pipe: (%d) -> pid:%d ; length:%d",count++,rx_payload.pipe,rx_payload.pid,rx_payload.length);
        NRF_LOG_INFO("HSM - src: (%d) -> pid:0x%02X ; length:%d",rx_msg.source,rx_msg.pid, rx_msg.payload_length);
        mesh_rx_handler(&rx_msg);
    }
}

void nrf_esb_event_handler(nrf_esb_evt_t const * p_event)
{
    switch (p_event->evt_id)
    {
        case NRF_ESB_EVENT_TX_SUCCESS:
            NRF_LOG_DEBUG("ESB TX SUCCESS EVENT");
            mesh_post_tx();
            esb_tx_complete = true;
            break;
        case NRF_ESB_EVENT_TX_FAILED:
            NRF_LOG_DEBUG("ESB TX FAILED EVENT");
            (void) nrf_esb_flush_tx();
            mesh_post_tx();
            esb_tx_complete = true;
            break;
        case NRF_ESB_EVENT_RX_RECEIVED:
            NRF_LOG_DEBUG("________________ESB RX RECEIVED EVENT________________");
            //Do nothing, handled in while loop
            //but return immidiatly so that more rx events are filled in the rx fifo
            break;
        default:
            esb_completed = true;
            NRF_LOG_ERROR("ESB Unhandled Event (%d)",p_event->evt_id);
            break;
    }

    esb_completed = true;
}


uint32_t mesh_init(app_mesh_rf_handler_t rf_handler,app_mesh_cmd_handler_t cmd_handler)
{
    uint32_t err_code;
    uint8_t base_addr_0[4] = {0xE7, 0xE7, 0xE7, 0xE7};
    uint8_t base_addr_1[4] = {0xC2, 0xC2, 0xC2, 0xC2};
    uint8_t addr_prefix[8] = {0xE7, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8 };

    m_app_rf_handler = rf_handler;
    m_app_cmd_handler = cmd_handler;

    nrf_esb_config.retransmit_count         = 0;
    nrf_esb_config.selective_auto_ack       = true;//false is not supported : payload.noack  decides
    nrf_esb_config.protocol                 = NRF_ESB_PROTOCOL_ESB_DPL;
    nrf_esb_config.payload_length           = 8;//Not used by DPL as then the MAX is configured
    nrf_esb_config.bitrate                  = NRF_ESB_BITRATE_2MBPS;
    nrf_esb_config.event_handler            = nrf_esb_event_handler;
    if(UICR_is_listening())
    {
        nrf_esb_config.mode                     = NRF_ESB_MODE_PRX;
    }
    else
    {
        nrf_esb_config.mode                     = NRF_ESB_MODE_PTX;
    }

    nrf_esb_config.crc                      = NRF_ESB_CRC_16BIT;

    err_code = nrf_esb_init(&nrf_esb_config);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_0(base_addr_0);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_base_address_1(base_addr_1);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_prefixes(addr_prefix, 8);
    VERIFY_SUCCESS(err_code);

    err_code = nrf_esb_set_rf_channel(UICR_RF_CHANNEL);
    VERIFY_SUCCESS(err_code);

    tx_payload.length  = 8;
    tx_payload.pipe    = 0;
    tx_payload.data[0] = 0x00;

    NRF_LOG_INFO("nodeId %d",UICR_NODE_ID);
    NRF_LOG_INFO("channel %d",UICR_RF_CHANNEL);

    if(UICR_is_listening())
    {
        err_code = nrf_esb_start_rx();
        VERIFY_SUCCESS(err_code);
        NRF_LOG_INFO("UICR listening");
    }
    else
    {
        NRF_LOG_INFO("UICR Not listening");
    }


    return NRF_SUCCESS;
}

/**
 * @brief can be used before going into sleep as RADIO does not operate in low power
 * This will return either after success or failure event
 */
void mesh_wait_tx()
{
    while(!esb_completed);
}



//--------------------------------------------------------------------------
//------------------------- Messages Serialisation -------------------------
//--------------------------------------------------------------------------


void mesh_tx_raw(uint8_t* p_data,uint8_t size)
{
    mesh_pre_tx();

    tx_payload.length   = size + 1;//as size itself is now added
    tx_payload.data[0] = tx_payload.length;
    memcpy( tx_payload.data+1,
            p_data,
            size);

    esb_completed = false;//reset the check
    nrf_esb_write_payload(&tx_payload);
}


/**
 * @brief Transmits a message structure
 * 
 * @param msg : the message structure to be converted to an esb buffer and sent through nrf_esb_write_payload
 */
void mesh_tx_message(message_t* p_msg)
{
    mesh_pre_tx();

    mesh_message_2_esb_payload(p_msg,&tx_payload);

    esb_completed = false;//reset the check
    NRF_LOG_DEBUG("________________TX esb payload length = %d________________",tx_payload.data[0]);
    //should not wait for esb_completed here as does not work from ISR context

    //NRF_ESB_TXMODE_AUTO is used no need to call nrf_esb_start_tx()
    //which could be used for a precise time transmission
    nrf_esb_write_payload(&tx_payload);
    
    //nrf_esb_start_tx();//as the previous mode does not start it due to .mode
}

/**
 * @brief Transmits a button message
 * 
 * @param state button state press 0 or release 1
 * @return uint32_t NRF_SUCCESS
 */
uint32_t mesh_tx_button(uint8_t state)
{
    message_t msg;

    msg.control = 0x80 | 2;         // broadcast | ttl = 2
    msg.pid     = Mesh_Pid_Button;
    msg.source  = UICR_NODE_ID;
    msg.payload = &state;       //this will only be used from within the context of this function
    msg.payload_length = 1;

    mesh_tx_message(&msg);

    return NRF_SUCCESS;
}

/**
 * @brief Sends a simple message that has no payload, by providing only the pid
 * 
 * @param pid the application protocol id : e.g. reset,...
 * @return uint32_t 
 */
uint32_t mesh_tx_pid(uint8_t pid)
{
    message_t msg;

    msg.control = 0x80 | 2;         // broadcast | ttl = 2
    msg.pid     = pid;
    msg.source  = UICR_NODE_ID;
    msg.payload_length = 0;

    mesh_tx_message(&msg);

    return NRF_SUCCESS;
}

/**
 * @brief Sends a reset message, used usually when a device wakes up from reset
 * Combined in a database, it keeps history of when the device was first started
 * Of whether the device has reset du to any error
 * 
 */
void mesh_tx_reset()
{
    mesh_tx_pid(Mesh_Pid_Reset);
}

void mesh_tx_data(uint8_t pid,uint8_t * data,uint8_t size)
{
    message_t msg;

    msg.control = 0x80 | 2;         // broadcast | ttl = 2
    msg.pid     = pid;
    msg.source  = UICR_NODE_ID;
    msg.payload = data;
    msg.payload_length = size;

    mesh_tx_message(&msg);
}

/**
 * @brief Broadcast an alive packet with associated payload information
 * The payload contains a livecounter (uint32_t) and the RF transmission power (int8_t)
 * 
 */
uint32_t mesh_tx_alive()
{
    static uint32_t live_count = 0;

    uint8_t data[5];
    data[0] = 0xFF & (uint8_t)(live_count >> 24);
    data[1] = 0xFF & (uint8_t)(live_count >> 16);
    data[2] = 0xFF & (uint8_t)(live_count >> 8);
    data[3] = 0xFF & (uint8_t)(live_count );
    data[4] = NRF_RADIO->TXPOWER;

    mesh_tx_data(Mesh_Pid_Alive,data,5);
    
    return live_count++;//returns the first used value before the increment
}



