nRFMesh/nRF52_Mesh/drivers/mesh.c
void mesh_parse_bytes(message_t* msg,char * p_msg)
{ 
    int add;
    add = sprintf(p_msg,"0x%02X 0x%02X 0x%02X 0x%02X",msg->control,msg->pid,msg->source,msg->dest);
    p_msg += add;
    //CRC takes two bytes
    if(msg->payload_length > 0)
    {
        add = sprintf(p_msg,"; (%d) payload: 0x",msg->payload_length);
        p_msg += add;
    }
    for(int i=0;i<msg->payload_length;i++)
    {
        add = sprintf(p_msg,"%02X ",msg->payload[i]);
        p_msg += add;
    }
    sprintf(p_msg,"\r\n");
}



//------------------------------------------------------------------
//------------------------- Mesh Commander -------------------------
//------------------------------------------------------------------


/**
 * @brief Executes a command received in a binary format
 * 
 * @param data the array starting with <cmd_id> followed by <param0><param1>,...
 * @param size the total size including the first byte of cmd_id
 */
void mesh_execute_cmd(uint8_t*data,uint8_t size)
{
    char resp[32];
    uint8_t resp_len;
    switch(data[0])
    {
        case MESH_cmd_node_id_set:
        {
            //TODO persistance of parameters
            resp_len = sprintf(resp,"cmd:set_node_id;set:%u;get:%u",data[1],mesh_node_id());
        }
        break;
        case MESH_cmd_node_id_get:
        {
            resp_len = sprintf(resp,"cmd:get_node_id;node_id:%u",mesh_node_id());
        }
        break;
        case MESH_cmd_rf_chan_set:
        {
            mesh_wait_tx();//in case any action was ongoing
            nrf_esb_stop_rx();
            nrf_esb_set_rf_channel(data[1]);
            nrf_esb_start_rx();
            resp_len = sprintf(resp,"cmd:set_channel;set:%u;get:%u",data[1],mesh_get_channel());
        }
        break;
        case MESH_cmd_rf_chan_get:
        {
            resp_len = sprintf(resp,"cmd:get_channel;channel:%u",mesh_get_channel());
        }
        break;
        case MESH_cmd_crc_set:
        {
            mesh_wait_tx();//in case any action was ongoing
            nrf_esb_stop_rx();
            mesh_set_crc(data[1]);
            nrf_esb_start_rx();
            resp_len = sprintf(resp,"cmd:set_crc;set:%u;get:%u",data[1],mesh_get_crc());
        }
        break;
        case MESH_cmd_crc_get:
        {
            resp_len = sprintf(resp,"cmd:get_crc;crc:%u",mesh_get_crc());
        }
        break;
        default:
        {
            resp_len = sprintf(resp,"cmd:0x%02X;len:%d",data[0],size);
        }
        break;
    }
    m_app_cmd_handler(resp,resp_len);
}

/**
 * @brief executes teh command immidiatly
 * Future extension should use a command fifo
 * 
 * @param text contains a command line to execute a mesh rf function
 * supported commands :
 * * msg:0x00112233445566...
 * where 0:length, 1:control , 2:source , 3:dest/payload , 4:payload,...
 * * cmd:0x00112233445566
 * where 0x00 is the command id
 * the rest are the command parameters including : crc_cfg, header_cfg, bitrate,...
 * @param length number of characters in msg
 */
void mesh_text_request(const char*text,uint8_t length)
{
    if(strbegins(text,"msg:"))
    {
        uint8_t data[32];//TODO define global max cmd size
        uint8_t size;
        if(text2bin(text+4,length-4,data,&size))
        {
            mesh_tx_raw(data,size);
            char resp[32];
            uint8_t resp_len = sprintf(resp,"sent_msg_len:%d",size);
            m_app_cmd_handler(resp,resp_len);
        }
    }
    else if(strbegins(text,"cmd:"))
    {
        uint8_t data[32];//TODO define global max cmd size
        uint8_t size;
        if(text2bin(text+4,length-4,data,&size))
        {
            mesh_execute_cmd(data,size);
        }
    }
}
